Catalogs/фин_КлассификаторРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_КлассификаторРегистров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьПервичныеДанныеПоБюджетированию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегистра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыРегистровСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_ВидыРегистровСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыРегистровСистемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РегистрыСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрыНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрыБухгалтерии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрыРасчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_КлассификаторРегистров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

Функция ПолучитьОбъектМетаданныхРегистраПоСсылке(ВидРегистраСсылка) Экспорт
	Если ВидРегистраСсылка.ВидРегистра.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ВидРегистраСсылка.ПрограммныйИдентификатор="" Тогда
		Возврат Неопределено;
	КонецЕсли;
	СоответствиеРегистров= Новый Соответствие;
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыСведений,		"РегистрыСведений");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыБухгалтерии,	"РегистрыБухгалтерии");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыНакопления,	"РегистрыНакопления");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыРасчета,		"РегистрыРасчета");
	Возврат Метаданные[СоответствиеРегистров.Получить(ВидРегистраСсылка.ВидРегистра)].Найти(ВидРегистраСсылка.ПрограммныйИдентификатор);
КонецФункции
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецЕсли
